summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_ABM_OFF (27)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_LEN (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_OFF (9)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_OSM_OFF (26)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_RST_CCU0_OFF (20)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SLA_OFF (25)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ABM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ABM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ABM_OFF (27)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB10 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB10_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB10 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB10_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB10 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB10_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB42 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB42_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB42 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB42_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ACB42 */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ACB42_OFF (6)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_CMP_CTRL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_CMP_CTRL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_CMP_CTRL_OFF (9)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SLA_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SLA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_SLA_OFF (25)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TB12_SEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TB12_SEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TB12_SEL_OFF (2)

