summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TRIGOUT_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TRIGOUT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_TRIGOUT_OFF (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_WR_REQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_WR_REQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_SOMC_WR_REQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ACB0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ACB0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ACB0_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMI_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMI_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.ADL */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_ADL_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.ADL */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_ADL_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.ADL */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_ADL_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_CLK_SRC_SR_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_CLK_SRC_SR_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_CLK_SRC_SR_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_OSM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_OSM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.OSM */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_OSM_OFF (26)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_RST_CCU0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_RST_CCU0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_RST_CCU0_OFF (20)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_TRIGOUT_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_TRIGOUT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMP_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_CTRL_SOMP_TRIGOUT_OFF (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_ACB0_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_ACB0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_ACB0_OFF (4)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_ARU_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_ARU_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_CLK_SRC_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_CTRL_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_SOMS_MODE_MSK (0x3)

