summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_CNT_NUM1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM1_CNT_NUM_1_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CNT_NUM2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM2_CNT_NUM_2_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CNT_NUM2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM2_CNT_NUM_2_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CNT_NUM2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM2_CNT_NUM_2_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.COA */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_COA_OFF (3)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM1_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DLM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DLM2_OFF (9)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.DMO */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_DMO_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM1_OFF (7)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PCM2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PCM2_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.PIT */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_PIT_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE1 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE1_OFF (5)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SGE2 */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SGE2_OFF (8)

/** \\brief  Length for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_LEN (21)

/** \\brief  Mask for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_MSK (0x1fffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits.SYN_NS */
#define IFX_GTM_DPLL_CRTL_1_SHADOW_STATE_SYN_NS_OFF (11)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_OFF (25)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_OFF (26)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_OFF (27)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_OFF (28)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_OFF (10)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_MSK (0x1)

