summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_PSSM_1_PSSM_OLD_0_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_1_PSSM_OLD_0_PSSM_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTM_0_PSTM_0_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_0_PSTM_0_PSTM_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTM_0_PSTM_0_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_0_PSTM_0_PSTM_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTM_0_PSTM_0_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_0_PSTM_0_PSTM_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTM_0_PSTM_OLD_1_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_0_PSTM_OLD_1_PSTM_OLD_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTM_0_PSTM_OLD_1_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_0_PSTM_OLD_1_PSTM_OLD_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTM_0_PSTM_OLD_1_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_0_PSTM_OLD_1_PSTM_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTM_1_PSTM_1_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_1_PSTM_1_PSTM_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTM_1_PSTM_1_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_1_PSTM_1_PSTM_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTM_1_PSTM_1_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_1_PSTM_1_PSTM_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_PSTM_1_PSTM_OLD_0_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_1_PSTM_OLD_0_PSTM_OLD_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PSTM_1_PSTM_OLD_0_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_1_PSTM_OLD_0_PSTM_OLD_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PSTM_1_PSTM_OLD_0_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_1_PSTM_OLD_0_PSTM_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1a */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1a */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1a */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1b */
#define IFX_GTM_DPLL_RAM_INI_INIT_1B_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1b */
#define IFX_GTM_DPLL_RAM_INI_INIT_1B_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1b */
#define IFX_GTM_DPLL_RAM_INI_INIT_1B_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_OFF (4)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_RDT_T_ACT_Bits.RDT_T_ACT */
#define IFX_GTM_DPLL_RDT_T_ACT_RDT_T_ACT_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_RDT_T_ACT_Bits.RDT_T_ACT */
#define IFX_GTM_DPLL_RDT_T_ACT_RDT_T_ACT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_RDT_T_ACT_Bits.RDT_T_ACT */
#define IFX_GTM_DPLL_RDT_T_ACT_RDT_T_ACT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_LEN (8)

/** \\brief  Mask for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_STATUS_Bits.BWD1 */
#define IFX_GTM_DPLL_STATUS_BWD1_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_STATUS_Bits.BWD1 */
#define IFX_GTM_DPLL_STATUS_BWD1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_STATUS_Bits.BWD1 */
#define IFX_GTM_DPLL_STATUS_BWD1_OFF (23)

