summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_MSK (0x1)

