summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH7_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH8_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH8_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH8_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH9_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH9_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH9_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH0_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH10_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH10_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH10_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH11_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH11_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH11_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH12_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH12_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH12_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_LEN (1)

