summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_OFF (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_OFF (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_OFF (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_OFF (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_OFF (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_OFF (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL0_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL0_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL2_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL2_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL2_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL3_LEN (3)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL3_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_DSADC_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_DSADC_OUTSEL_SEL3_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL1_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_PSI5_OUTSEL0_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_PSI5_OUTSEL0_SEL2_LEN (4)

