summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_OFF (2)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_OFF (10)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_CTRG_TRG11_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_CTRG_TRG11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_CTRG_TRG11_OFF (11)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_CTRG_TRG12_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_CTRG_TRG12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_CTRG_TRG12_OFF (12)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_CTRG_TRG13_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_CTRG_TRG13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_CTRG_TRG13_OFF (13)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_CTRG_TRG14_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_CTRG_TRG14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_CTRG_TRG14_OFF (14)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_CTRG_TRG15_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_CTRG_TRG15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_CTRG_TRG15_OFF (15)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_CTRG_TRG1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_CTRG_TRG1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_CTRG_TRG1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_CTRG_TRG2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_CTRG_TRG2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_CTRG_TRG2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_CTRG_TRG3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_CTRG_TRG3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_CTRG_TRG3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_CTRG_TRG4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_CTRG_TRG4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_CTRG_TRG4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_CTRG_TRG5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_CTRG_TRG5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_CTRG_TRG5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_CTRG_TRG6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_CTRG_TRG6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_CTRG_TRG6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_CTRG_TRG7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_CTRG_TRG7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_CTRG_TRG7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_CTRG_TRG8_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_CTRG_TRG8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_CTRG_TRG8_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_CTRG_TRG9_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_CTRG_TRG9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_CTRG_TRG9_OFF (9)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_STRG_TRG0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_STRG_TRG0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_STRG_TRG0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_STRG_TRG10_LEN (1)

