summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_STRG_TRG10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_STRG_TRG10_OFF (10)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_STRG_TRG11_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_STRG_TRG11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH0_STRG_TRG11_OFF (11)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_STRG_TRG12_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_STRG_TRG12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH0_STRG_TRG12_OFF (12)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_STRG_TRG13_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_STRG_TRG13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH0_STRG_TRG13_OFF (13)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_STRG_TRG14_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_STRG_TRG14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH0_STRG_TRG14_OFF (14)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_STRG_TRG15_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_STRG_TRG15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH0_STRG_TRG15_OFF (15)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_STRG_TRG1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_STRG_TRG1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH0_STRG_TRG1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_STRG_TRG2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_STRG_TRG2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH0_STRG_TRG2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_STRG_TRG3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_STRG_TRG3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH0_STRG_TRG3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_STRG_TRG4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_STRG_TRG4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH0_STRG_TRG4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_STRG_TRG5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_STRG_TRG5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH0_STRG_TRG5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_STRG_TRG6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_STRG_TRG6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH0_STRG_TRG6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_STRG_TRG7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_STRG_TRG7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH0_STRG_TRG7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_STRG_TRG8_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_STRG_TRG8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH0_STRG_TRG8_OFF (8)

/** \\brief  Length for Ifx_GTM_MCS_CH0_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_STRG_TRG9_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_STRG_TRG9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH0_STRG_TRG9_OFF (9)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_LEN (1)

