summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_OFF (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_OFF (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_OFF (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_OFF (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_OFF (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_OFF (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_OFF (8)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_OFF (9)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_OFF (10)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_OFF (11)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_OFF (12)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_OFF (13)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_OFF (14)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_OFF (15)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_OFF (16)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_MSK (0x1)

