summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_OFF (4)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_OFF (6)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_OFF (8)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_OFF (10)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_OFF (12)

/** \\brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_LEN (2)

/** \\brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_OFF (14)

/** \\brief  Length for Ifx_GTM_TS_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_TS_FTV_T_TRIGGER_FT_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_TS_FTV_T_TRIGGER_FT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_TS_FTV_T_TRIGGER_FT_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_S_0_S_0_Bits.STATE_TS */
#define IFX_GTM_TS_S_0_S_0_STATE_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_S_0_S_0_Bits.STATE_TS */
#define IFX_GTM_TS_S_0_S_0_STATE_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_S_0_S_0_Bits.STATE_TS */
#define IFX_GTM_TS_S_0_S_0_STATE_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_S_0_S_OLD_0_Bits.STATE_TS_OLD */
#define IFX_GTM_TS_S_0_S_OLD_0_STATE_TS_OLD_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_S_0_S_OLD_0_Bits.STATE_TS_OLD */
#define IFX_GTM_TS_S_0_S_OLD_0_STATE_TS_OLD_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_S_0_S_OLD_0_Bits.STATE_TS_OLD */
#define IFX_GTM_TS_S_0_S_OLD_0_STATE_TS_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_S_1_S_1_Bits.STATE_TS */
#define IFX_GTM_TS_S_1_S_1_STATE_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_S_1_S_1_Bits.STATE_TS */
#define IFX_GTM_TS_S_1_S_1_STATE_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_S_1_S_1_Bits.STATE_TS */
#define IFX_GTM_TS_S_1_S_1_STATE_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_S_1_S_OLD_1_Bits.STATE_TS_OLD */
#define IFX_GTM_TS_S_1_S_OLD_1_STATE_TS_OLD_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_S_1_S_OLD_1_Bits.STATE_TS_OLD */
#define IFX_GTM_TS_S_1_S_OLD_1_STATE_TS_OLD_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_S_1_S_OLD_1_Bits.STATE_TS_OLD */
#define IFX_GTM_TS_S_1_S_OLD_1_STATE_TS_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_T_0_T_0_Bits.TRIGGER_TS */
#define IFX_GTM_TS_T_0_T_0_TRIGGER_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_T_0_T_0_Bits.TRIGGER_TS */
#define IFX_GTM_TS_T_0_T_0_TRIGGER_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_T_0_T_0_Bits.TRIGGER_TS */
#define IFX_GTM_TS_T_0_T_0_TRIGGER_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_T_0_T_OLD_0_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_TS_T_0_T_OLD_0_TRIGGER_TS_OLD_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_T_0_T_OLD_0_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_TS_T_0_T_OLD_0_TRIGGER_TS_OLD_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_T_0_T_OLD_0_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_TS_T_0_T_OLD_0_TRIGGER_TS_OLD_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_T_1_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_TS_T_1_T_1_TRIGGER_TS_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_T_1_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_TS_T_1_T_1_TRIGGER_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_T_1_T_1_Bits.TRIGGER_TS */
#define IFX_GTM_TS_T_1_T_1_TRIGGER_TS_OFF (0)

/** \\brief  Length for Ifx_GTM_TS_T_1_T_OLD_1_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_TS_T_1_T_OLD_1_TRIGGER_TS_OLD_LEN (24)

/** \\brief  Mask for Ifx_GTM_TS_T_1_T_OLD_1_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_TS_T_1_T_OLD_1_TRIGGER_TS_OLD_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_TS_T_1_T_OLD_1_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_TS_T_1_T_OLD_1_TRIGGER_TS_OLD_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_BF_H */
